wso2/iskm-mcm/scripts/serviceProviders/updateApplication~.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://org.apache.axis2/xsd" xmlns:xsd1="http://model.common.application.identity.carbon.wso2.org/xsd" xmlns:xsd2="http://script.model.common.application.identity.carbon.wso2.org/xsd">
   <soap:Header/>
   <soap:Body>
      <xsd:updateApplication>
         <xsd:serviceProvider>
            <xsd1:applicationID>@appid@</xsd1:applicationID>
            <xsd1:applicationName>travelocity.com</xsd1:applicationName>
            <xsd1:claimConfig>
               <xsd1:alwaysSendMappedLocalSubjectId>false</xsd1:alwaysSendMappedLocalSubjectId>
               <xsd1:claimMappings>
                  <xsd1:defaultValue></xsd1:defaultValue>
                  <xsd1:localClaim>
                     <xsd1:claimId>0</xsd1:claimId>
                     <xsd1:claimUri>http://wso2.org/claims/2fa-enrolled</xsd1:claimUri>
                  </xsd1:localClaim>
                  <xsd1:mandatory>true</xsd1:mandatory>
                  <xsd1:remoteClaim>
                     <xsd1:claimId>0</xsd1:claimId>
                     <xsd1:claimUri>2fa-enrolled</xsd1:claimUri>
                  </xsd1:remoteClaim>
                  <xsd1:requested>true</xsd1:requested>
               </xsd1:claimMappings>
            </xsd1:claimConfig>
            <xsd1:localAndOutBoundAuthenticationConfig>
               <xsd1:alwaysSendBackAuthenticatedListOfIdPs>false</xsd1:alwaysSendBackAuthenticatedListOfIdPs>
               <xsd1:authenticationScriptConfig/>
               <xsd1:authenticationStepForAttributes/>
               <xsd1:authenticationStepForSubject/>
               <xsd1:authenticationSteps/>
               <xsd1:authenticationType>default</xsd1:authenticationType>
               <xsd1:enableAuthorization>false</xsd1:enableAuthorization>
               <xsd1:subjectClaimUri>http://wso2.org/claims/username</xsd1:subjectClaimUri>
               <xsd1:useTenantDomainInLocalSubjectIdentifier>false</xsd1:useTenantDomainInLocalSubjectIdentifier>
               <xsd1:useUserstoreDomainInLocalSubjectIdentifier>false</xsd1:useUserstoreDomainInLocalSubjectIdentifier>
               <xsd1:useUserstoreDomainInRoles>true</xsd1:useUserstoreDomainInRoles>
            </xsd1:localAndOutBoundAuthenticationConfig>            
         </xsd:serviceProvider>
      </xsd:updateApplication>
   </soap:Body>
</soap:Envelope>